/****************************************************************************************************
** File name:      ErrorProcessing.h
** функции обработки ошибок и системных сообщений
****************************************************************************************************/

#ifndef __ERRORPROCESSING_H
#define __ERRORPROCESSING_H

//------- Error messages ---------------------------------------------------------------
#define GLOBAL_ERROR				0x01				// зажигаем красный светодиод... пока для всех ошибок


void SendError (unsigned char error_code);

#endif			// __ERRORPROCESSING_H

